sql/sql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-31 Mon 19:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Structured Query Language(SQL)</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Compro Prasad" />
</head>
<body>
<div id="content">
<h1 class="title">Structured Query Language(SQL)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline10">2. Basics</a>
<ul>
<li><a href="#orgheadline2">2.1. Logging in</a></li>
<li><a href="#orgheadline3">2.2. What is a query?</a></li>
<li><a href="#orgheadline4">2.3. Accessing Databases/Schemas</a></li>
<li><a href="#orgheadline6">2.4. Accessing Table</a></li>
<li><a href="#orgheadline8">2.5. Accessing columns</a>
<ul>
<li><a href="#orgheadline7">2.5.1. Most used types of columns:</a></li>
</ul>
</li>
<li><a href="#orgheadline5">2.6. Using databases</a></li>
<li><a href="#orgheadline9">2.7. Accessing rows</a></li>
</ul>
</li>
<li><a href="#orgheadline16">3. Creating</a>
<ul>
<li><a href="#orgheadline11">3.1. Databases</a></li>
<li><a href="#orgheadline13">3.2. Tables</a>
<ul>
<li><a href="#orgheadline12">3.2.1. Basic table</a></li>
<li><a href="#orgheadline14">3.2.2. <code>NOT NULL</code> contraint</a></li>
<li><a href="#orgheadline15">3.2.3. <code>UNIQUE</code> contraint</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline18">4. Droping</a>
<ul>
<li><a href="#orgheadline17">4.1. Tables</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>SQL</code> is the interface for communicating to a binary file
which is called a <code>database</code> in terms of <code>SQL</code>. So, keep in
mind that if you change the binary file using an editor like
<a href="http://hexedit.com/">hexedit</a> then you could run into problems. So, don't mess
with such kinds of files on your computer.<br  />
A <b>database</b> is further divided into <b>tables</b>. Tables are further
divided into two categories: <b>columns</b> and <b>rows</b>.<br  />
It also has concepts of <code>RDBMS</code> in which you can link two
distinct tables using similar columns in each of them. This
can create a pretty huge relationships just like in the real world.<br  />
Please make sure a <code>SQL</code> is installed on your machine before
starting this tutorial.
</p>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> Basics</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Logging in</h3>
<div class="outline-text-3" id="text-2-1">
<p>
It is necessary to login to access the whole/part of your
<code>SQL</code>. Now you would say that there is no use of login. But
what if the frontend developer of <a href="https://facebook.com/">Facebook</a> gets into the
database and steals information of everybody.<br  />
So, there is a concept of users in <code>SQL</code>. This removes the
necessity of having different things in the same place.
Instead, <code>SQL</code> just puts everything in the same place and
permits the specific user to the specific information.
</p>

<p>
Here, is a simple command for logging into <code>SQL</code> using
<b>tom</b> as the username:
</p>
<div class="org-src-container">

<pre class="src src-sh">mysql -u tom -p
</pre>
</div>
<p>
After pressing <code>RETURN</code> mysql would ask for a password.
Enter your password and you are good to go.
</p>

<p>
Note: During the time of installation the default user is <b>root</b>.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> What is a query?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Query is a successful statement in <code>SQL</code> that gets a job done
by the end user. It can be creating tables or inserting values
or modifying values etc. The following are some examples of
queries in <code>MySQL</code>:
</p>
<div class="org-src-container">

<pre class="src src-sql" id="orgsrcblock1"><span style="color: #5FB7CC;">create</span> <span style="color: #5FB7CC;">table</span> <span style="color: #1D68C4; font-weight: bold;">information</span>(column1 <span style="color: #7FFFD4;">int</span>);
use login_db;
<span style="color: #5FB7CC;">select</span> 1+2 <span style="color: #5FB7CC;">from</span> dual;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> Accessing Databases/Schemas</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Now, since you have logged in you have the control over what
you have access to. You may not have been permitted to access
even a single database. To see the schemas run this query:
</p>
<div class="org-src-container">

<pre class="src src-sql">show databases;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.4</span> Accessing Table</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Don't you know tables?!
There can be many tables inside a database. Thats enough
introduction to tables in <code>SQL</code>
</p>
<div class="org-src-container">

<pre class="src src-sql">show tables <span style="color: #5FB7CC;">from</span> information_schema;
</pre>
</div>
<p>
Replace <b>information<sub>schema</sub></b> with the database of your
choice.<br  />
You can also use:
</p>
<div class="org-src-container">

<pre class="src src-sql">show tables;
</pre>
</div>
<p>
when you are using a specific database. See <a href="#orgheadline5">Using databases</a>.
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.5</span> Accessing columns</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sql">show columns <span style="color: #5FB7CC;">from</span> information_schema.collations;
</pre>
</div>
<p>
It is of the form <code>&lt;database&gt;.&lt;table&gt;</code>.<br  />
Want a shorter form? Use the following approach:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">describe</span> information_schema.collations;
</pre>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">2.5.1</span> Most used types of columns:</h4>
<div class="outline-text-4" id="text-2-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">char(n)</td>
<td class="org-left">A string of characters of length <code>n</code>.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Same memory consumption for different</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">strings.</td>
</tr>

<tr>
<td class="org-left">varchar(n)</td>
<td class="org-left">A string of characters of length <code>n</code>.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Memory consumption according to length</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">An integer field</td>
</tr>

<tr>
<td class="org-left">bigint</td>
<td class="org-left">An integer field with a large range</td>
</tr>

<tr>
<td class="org-left">date</td>
<td class="org-left">A date of the form <code>YYYY-MM-DD</code></td>
</tr>

<tr>
<td class="org-left">datetime</td>
<td class="org-left">A field addressing a date and time</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">value.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.6</span> Using databases</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Databases are less in comparison to the tables in
each database. Therefore, writing <code>&lt;database&gt;.&lt;table&gt;</code>
can be a bit tedious. So, there is a feature in sql
and that is using a database:
</p>
<div class="org-src-container">

<pre class="src src-sql">use information_schema;
</pre>
</div>
<p>
You can now see columns using:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">describe</span> collations;
</pre>
</div>
<p>
Since you are using the database, you cannot operate
on a table thats inside another database using a normal
syntax.
But you can do two things outside the database. 
They are:
</p>
<div class="org-src-container">

<pre class="src src-sql">show databases;
use performance_schema;
</pre>
</div>
<p>
Here <b>performance<sub>schema</sub></b> can be another database you
would like to use.
From now on it will be assumed that you are using a
database and then the respective query can be run after
that.
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.7</span> Accessing rows</h3>
<div class="outline-text-3" id="text-2-7">
<p>
See all rows and columns from a table:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">select</span> * <span style="color: #5FB7CC;">from</span> collations;
</pre>
</div>
<p>
Filter specific set of rows from a table:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">select</span> is_default, sortlen <span style="color: #5FB7CC;">from</span> collations;
</pre>
</div>
<p>
Filter specific set of rows and columns from a table:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">select</span> is_default, sortlen <span style="color: #5FB7CC;">from</span> collations <span style="color: #5FB7CC;">where</span> id &lt; 50 <span style="color: #5FB7CC;">and</span> is_default=<span style="color: #aa3939;">'Yes'</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">3</span> Creating</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.1</span> Databases</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">create</span> database login_db;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.2</span> Tables</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">3.2.1</span> Basic table</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">create</span> <span style="color: #5FB7CC;">table</span> <span style="color: #1D68C4; font-weight: bold;">info</span>(
    username <span style="color: #7FFFD4;">varchar</span>(20),
    login_time <span style="color: #7FFFD4;">timestamp</span>,
    id bigint
);
</pre>
</div>
<p>
<code>info</code> is the name of the table to be created. Then
comes <code>username</code> which is the name of the field/column.
It is of type =varchar(20)=(see table in <a href="#orgheadline7">columns mostly used</a>).
A similar approach is followed for every column. First
the name of the column then the type of field.
</p>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">3.2.2</span> <code>NOT NULL</code> contraint</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
By default you can insert <code>NULL</code> values in any
field. But if a field has to has a value then
a <code>NOT NULL</code> contraint has to be added like:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">create</span> <span style="color: #5FB7CC;">table</span> <span style="color: #1D68C4; font-weight: bold;">info</span>(
    username <span style="color: #7FFFD4;">varchar</span>(20),
    login_time <span style="color: #7FFFD4;">timestamp</span> <span style="color: #5FB7CC;">not</span> <span style="color: #5FB7CC;">null</span>,
    id bigint <span style="color: #5FB7CC;">not</span> <span style="color: #5FB7CC;">null</span>
);
</pre>
</div>
<p>
You would get an error while doing that. See
<a href="#orgheadline13">Droping Tables</a> and rerun the above query.<br  />
The above query will prevent login<sub>time</sub> and id
from having <code>NULL</code> values.
</p>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">3.2.3</span> <code>UNIQUE</code> contraint</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
What if you wanted to create a field that had
unique values. For example, <a href="https://mail.google.com/">Gmail</a> uses this to
identify whether a user has already created an
account using the same e-mail.<br  />
But not all fields must be unique. For example,
you may find friends with same name on <a href="https://www.facebook.com/">Facebook</a>.
And if <a href="https://www.facebook.com/">Facebook</a> used <code>UNIQUE</code> contraint on the
name of the users then it would be pretty awkward.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">create</span> <span style="color: #5FB7CC;">table</span> <span style="color: #1D68C4; font-weight: bold;">info</span>(
    username <span style="color: #7FFFD4;">varchar</span>(20),
    login_time <span style="color: #7FFFD4;">timestamp</span> <span style="color: #5FB7CC;">not</span> <span style="color: #5FB7CC;">null</span>,
    id bigint <span style="color: #5FB7CC;">not</span> <span style="color: #5FB7CC;">null</span> <span style="color: #5FB7CC;">unique</span>
);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">4</span> Droping</h2>
<div class="outline-text-2" id="text-4">
<p>
Droping is same as deleting/removing
</p>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">4.1</span> Tables</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #5FB7CC;">drop</span> <span style="color: #5FB7CC;">table</span> <span style="color: #1D68C4; font-weight: bold;">info</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Compro Prasad</p>
<p class="date">Created: 2016-10-31 Mon 19:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
